###############################################################################################
###################################### Michele Santos #########################################
################################# Algoritimos e Programação I #################################
################################## IFPB - Eng. de Computação ##################################
###############################################################################################

anoVacina = int(input())
intervaloVacinacao = int(input())
anoPendentes = ''
for i in range(3):
    anoVacina +=intervaloVacinacao
    anoPendentes += str(anoVacina) + ' ' 
print (anoPendentes)
